ahmadawais.shades-of-purple
akamud.vscode-theme-onelight
astro-build.astro-vscode
beardedbear.beardedtheme
bradlc.vscode-tailwindcss
clemenspeters.format-json
danielgjackson.auto-dark-mode-windows
dbaeumer.vscode-eslint
deerawan.vscode-dash
donjayamanne.python-environment-manager
eliverlara.andromeda
enkia.tokyo-night
esbenp.prettier-vscode
giovanicascaes.calm-days-sober-nights-theme-vscode
github.vscode-pull-request-github
herrmannplatz.npm-dependency-links
jibjack.nineties
kevinrose.vsc-python-indent
liwei.relax-eyes-theme
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.vscode-typescript-next
pabue.linear-theme
pflannery.vscode-versionlens
ryanolsonx.solarized
sdras.night-owl
tobiasalthoff.atom-material-theme
tonsky.theme-alabaster
usernamehw.errorlens
waderyan.gitblame
wix.vscode-import-cost
xabikos.javascriptsnippets
