# Cursor/VS Code extensions list - extracted from Cursor installation
# Core Extensions
dbaeumer.vscode-eslint
esbenp.prettier-vscode
biomejs.biome
bradlc.vscode-tailwindcss

# Language Support
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy
denoland.vscode-deno
astro-build.astro-vscode

# Git & Version Control
eamodio.gitlens
waderyan.gitblame
github.github-vscode-theme
github.vscode-github-actions

# Productivity
alefragnani.bookmarks
gruntfuggly.todo-tree
usernamehw.errorlens
vscodevim.vim
chamboug.js-auto-backticks
xabikos.javascriptsnippets
yzhang.markdown-all-in-one
bierner.markdown-preview-github-styles

# Development Tools
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
postman.postman-for-vscode
qwtel.sqlite-viewer
wix.vscode-import-cost
pflannery.vscode-versionlens
herrmannplatz.npm-dependency-links
clemenspeters.format-json

# Themes (optional - comment out if not needed)
# enkia.tokyo-night
# sdras.night-owl
# beardedbear.beardedtheme
# eliverlara.andromeda
# tonsky.theme-alabaster

# Python specific
kevinrose.vsc-python-indent

# Utilities
ryuta46.multi-command
danielgjackson.auto-dark-mode-windows